
Increasing Access Security
--------------------------
	R1(config)# security passwords min-length 10
	R1(config)# service password-encryption
	R1(config-line)# line vty 0 4
	R1(config-line)# exec-timeout 3 30
	R1(config-line)# line console 0
	R1(config-line)# exec-timeout 3 30
	R1(config-line)# line aux 0
	R1(config-line)# no exec

Secret Password Algorithms
---------------------------
	R1(config)# enable algorithm-type scrypt secret cisco12345
	R1(config)# username Admin algorithm-type scrypt secret cisco54321

- md5 (type 5)
- sha256 (type 8)
- scrypt (type 9)

Securing Line Access
--------------------
By default, console and auxiliary ports do not require password for administrative access.
The password command configured on console, vty and auxiliary lines can only use type 7.
vty lines should only be configured for ssh.

	R1(config)# line con 0
	R1(config-line)# login local
	R1(config)# line aux 0
	R1(config-line)# login local
	R1(config)# line vty 0 4
	R1(config-line)# login local
	R1(config-line)# transport input ssh

Banner Command Syntax
---------------------
	R1(config)# banner {motd | exec | login} <delimiter> <message> <delimiter>

Configuring Login Enhancement Features
--------------------------------------
	R1(config)# login block-for <seconds> attempts <tries> within <seconds>
	R1(config)# login quiet-mode access-class {acl-name | acl-number}
	R1(config)# login delay <seconds>
	R1(config)# login on-success log [every <login-index>]
	R1(config)# login on-failure log [every <login-index>]

Example

	R1(config)# login block-for 15 attempts 5 within 60
	R1(config)# ip access-list standard PERMIT-ADMIN
	R1(config-std-nacl)# remark Permit only Administrative hosts
	R1(config-std-nacl)# permit 192.168.10.10
	R1(config-std-nacl)# permit 192.168.11.10
	R1(config-std-nacl)# exit
	R1(config)# login quiet-mode access-class PERMIT-ADMIN
	R1(config)# login delay 10
	R1(config)# login on-success log
	R1(config)# login on-failure log

These login enhancements do not apply to console connections; when dealing with console connections it is assumed that only authorized personnel have physical access to the device.
These login enhancements can only be enabled if the local database is used for authentication for local and remote access.
If the lines are configured for password authentication only then the enhanced login features are not enabled.

Enable Login Enhancements
-------------------------
All other login enhancement features are disabled until the login block-for command is configured.
The login block-for command monitors login device activity and operates in two modes:
* Normal mode
	- router keeps count of failed login attempts within specified amount of time
* Quiet mode
	- if count of failed logins exceeds the threshold then all login attempts using telnet, ssh and http are denied for the time specified in the login block-for command
	- when quiet mode is enabled, all login attempts, including valid administrative access, are not permitted; this can be overridden using an ACL using the login quiet-mode access-class command
When implementing the login block-for command, a 1 second delay between login attempts is automatically invoked.
The delay between login attempts can be increased using login delay command.

Logging Failed Attempts
-----------------------
	R1(config)# login on-success log [every <login-index>]
	R1(config)# login on-failure log [every <login-index>]
	R1(config)# security authentication failure rate <threshold> log

	R1# show login
	R1# show login failures

Steps for Configuring SSH
-------------------------
Requirements the router must meet before configuring SSH
* runs a Cisco IOS release that supports SSH
* uses a unique hostname
* contains the correct domain name of the network
* configured for local authentication or AAA services


	R1(config)# ip domain-name example.com
	R1(config)# crypto key generate rsa general-keys modulus 1024
	R1(config)# ip ssh version 2
	R1(config)# username Admin algorithm-type scrypt secret cisco54321
	R1(config)# line vty 0 4
	R1(config-line)# login local
	R1(config-line)# transport input ssh
	R1(config-line)# end
	
	R1# show crypto key mypubkey rsa
	
	R1(config)# crypto key zeroize rsa

Modifying the SSH Configuration
-------------------------------
	R1(config)# ip ssh time-out 60
	R1(config)# ip ssh authentication-retries 2
	
	R1# show ip ssh

Connecting to an SSH-Enabled Router
-----------------------------------
To verify the status of the client connections:

	R1# show ssh

Connecting to R1 from R2 via ssh:

	R2# ssh -l Admin <R1_ip_address>
