Limiting Command Availability
-----------------------------
By default, Cisco IOS CLI has two levels of access to commands:
* User EXEC mode (privilege level 1)
	- lowest EXEC mode and allows only user-level commands available at `>` prompt
* Privileged EXEC mode (privilege level 15)
	- includes all enable-level commands at `#` prompt

There are 16 privilege levels.
The higher the level the more commands access an user has.

	R1(config)# privilege mode {level <level> | reset} command

Configuring and Assigning Privilege Levels
------------------------------------------
	R1(config)# !Level 5 and SUPPORT user configuration
	R1(config)# privilege exec level 5 ping
	R1(config)# enable algorithm-type scrypt secret level 5 cisco5
	R1(config)# username SUPPORT privilege 5 algorithm-type scrypt secret cisco5
	
	R1(config)# !Level 10 and JR-ADMIN user configuration
	R1(config)# privilege exec level 10 reload
	R1(config)# enable algorithm-type scrypt secret level 10 cisco10
	R1(config)# username JR-ADMIN privilege 10 algorithm-type scrypt secret cisco10
	
	R1(config)# !level 15 and ADMIN user configuration
	R1(config)# enable algorithm-type scrypt secret level 15 cisco123
	R1(config)# username ADMIN privilege 15 algorithm-type scrypt secret cisco123

Configuring Role-Based CLI Views
--------------------------------
Administrator must log in as root view; 
when prompted enter the `enable` secret password: 
`R1# enable view`
or
`R1# enable view root`

	R1(config)# aaa new-model
	R1(config)# parser view SHOWVIEW
	R1(config-view)# secret cisco
	R1(config-view)# commands exec include show
	R1(config-view)# exit
	R1(config)# 
	R1(config)# parser view VERIFYVIEW
	R1(config-view)# secret cisco5
	R1(config-view)# commands exec include ping
	R1(config-view)# exit
	R1(config)# 
	R1(config)# parser view REBOOTVIEW
	R1(config-view)# secret cisco10
	R1(config-view)# commands exec include reload
	R1(config-view)# exit
	R1(config)# 
	
	R1# show running-config | section parser

Configuring Role-Based CLI Superviews
-------------------------------------
Administrator must log in as root view.

	R1(config)# parser view USER superview
	R1(config-view)# secret cisco
	R1(config-view)# view SHOWVIEW
	R1(config-view)# exit
	R1(config)# 
	R1(config)# parser view SUPPORT superview
	R1(config-view)# secret cisco1
	R1(config-view)# view SHOWVIEW
	R1(config-view)# view VERIFYVIEW
	R1(config-view)# exit
	R1(config)# 
	R1(config)# parser view JR-ADMIN superview
	R1(config-view)# secret cisco2
	R1(config-view)# view SHOWVIEW
	R1(config-view)# view VERIFYVIEW
	R1(config-view)# view REBOOTVIEW
	R1(config-view)# exit
	R1(config)# 
	
	R1# show running-config | section superview

Verify Role-Based CLI Views
---------------------------
	R1# show parser view
	
	R1# enable view <root>
	R1# show parser view all

- an `*` will identify superviews in the printed output