Enabling the IOS Image Resilience Feature
=========================================
R1(config)# secure boot-image
	- can only be disabled through a console session using the "no" form of the command

R1(config)# secure boot-config
	- takes a snapshot of the router running configuration and securely arvhice it in persistent storage

Secured files don't appear in output of "dir" command.
R1# show secure bootset

Commands to Restore a Primary Bootset Image
===========================================
R1# reload
rommon 1 > dir flash0:
rommon 2 > boot flash0:<image.bin>
R1> enable
R1# conf t
R1(config)# secure boot-config restore flash0:rescue-cfg
R1(config)# end
R1# copy flash0:rescue-cfg running-config

R1 SCP Server Configuration
===========================
R1(config)# ip domain-name example.com
R1(config)# crypto key generate rsa general-keys modulus 2048
R1(config)# username Admin privilege 15 algorithm-type scrypt secret cisco12345
R1(config)# aaa new-model
R1(config)# aaa authentication login default local
R1(config)# aaa authorization exec default local
R1(config)# ip scp server enable

R2 SCP Tranfer to R1
====================
R2# copy flash0:R2backup.cfg scp:
Address or name of remote host[]? 10.1.1.1
Destination username [R2]? Admin
Destiantion filename [R2backup.cfg]?
Writing R2backup.cfg
Password: <cisco12345>

R1# debug ip scp

Authentication failure will occur if the username/password combination was not configured with privilege 15 on SCP server.

Router Password Recovery Procedure
==================================
1. connect to the console port
2. record the configuration register setting
3. power cycle the router
4. issue the break sequence
5. change the configuration register with the confreg 0x2142
6. reboot the router
7. press Ctrl-C to skip the initial setup procedure
8. put the router into privileged EXEC mode
9. copy the startup configuration to the running configuration
10. verify the configuration
11. change the enable secret password
12. enable all interfaces
13. return the configuration-register to the original setting recorded on step 2;
	- use the config-register global config command
14. save the configuration changes

Disabling Password Recovery
===========================
R1(config)# no service password-recovery

To recover a device after no service password-recovery command, initiate the break sequence within five seconds after the image decompresses during boot.
You are prompted to confirm the break key action.
After the action is confirmed, the startup configuration is erased, the password recovery procedure is enabled, and the router boots with the factory default configuration.
If you do not confirm the break action, the router boots normally.

Configuring System Logging
==========================
R1(config)# logging host 10.x.y.z
R1(config)# logging trap informational
R1(config)# logging source-interface gigabitethernet0/1
R1(config)# logging on

R1# show logging

Introduction to SNMP
====================
SNMP aconsists of three elements relevant to the Network Management System (NMS)
* SNMP manager
	- listens on UDP port 162
* SNMP agents (managed node)
	- listen on UDP port 161
* Management Information Base (MIB)
	- each piece of information within the MIB is given an object ID (OID)

SNMPv3
======
Security Features:
* message integrity and authentication
	- ensures that a packet has not been tampered with in transit and is from a valid source
* encryption
	- scrambles the content of a packet to prevent it from being seen by an unauthorized source
* access control
	- restricts each principal to certain actions on specific portions of data

Secure SNMPv3 Configuration Example
===================================
R1(config)# ip access-list standard PERMIT-ADMIN
R1(config-std-nacl)# permit 192.168.1.0 0.0.0.255
R1(config-std-nacl)# exit
R1(config)# snmp-server engineID local 123456789A
R1(config)# snmp-server view SNMP-RO iso included
R1(config)# snmp-server group ADMIN v3 priv read SNMP-RO access PERMIT-ADMIN
R1(config)# snmp-server user Admin ADMIN v3 auth sha cisco12345 priv aes 128 cisco54321

Verifying the SNMPv3 Configuration
==================================
R1# show running-config | include snmp
R1# show snmp user

Network Time Protocol
=====================
NTP uses UDP port 123 and is documented in RFC 1305.

Setting time manually:
R1# clock set 22:10:00 DEC 12 2020

NTP Server
==========
R1(config) ntp master <stratum>
The stratum number is the number of hops away from an authoritative source such as an atomic clock.

Example R1 is NTP master and R2 is client:
	R1(config)# ntp master 1
	R1# show clock
	
	R2(config)# ntp server 10.10.10.1
	R2# show clock

NTP Authentication
==================
NTPv3 and later supports a cryptographic authentication mechanism between NTP peers.
Clients configured without authentication still get the time from the server.
The difference is that these clients do not authenticate the server as a secure source.

Example R1 is NTP master and R2 is client:
	R1(config)# ntp authenticate
	R1(config)# ntp authentication-key 1 md5 cisco123
	R1(config)# ntp trusted-key 1

	R2(config)# ntp authenticate
	R2(config)# ntp authentication-key 1 md5 cisco123
	R2(config)# ntp trusted-key 1
	R2# show ntp associations detail
